//===================================================
//
//    flipperクラスの処理[flipper.cpp]
//    Author:増澤 未来
//
//====================================================

//**********************************
// インクルード
//**********************************
#include "flipper.h"

//**********************************
// マクロ定義
//**********************************


//==================================
// コンストラクタ
//==================================
CFlipper::CFlipper()
{
	ZeroMemory(&m_flagState, sizeof(m_flagState));
}

//==================================
// デストラクタ
//==================================
CFlipper::~CFlipper()
{
}

//==================================
// クリエイト
//==================================
CFlipper * CFlipper::Create(void)
{
	// メモリの確保
	CFlipper * pFlipper = new CFlipper;

	// 初期化処理
	pFlipper->Init();

	return pFlipper;
}

//==================================
// 初期化処理
//==================================
HRESULT CFlipper::Init(void)
{
	// 旗状態の初期化
	m_flagState[FLIPPER_TYPE_LEFT] = FLIPPER_STATE_NONE;
	m_flagState[FLIPPER_TYPE_RIGHT] = FLIPPER_STATE_NONE;

	return S_OK;
}

//==================================
// 終了処理
//==================================
void CFlipper::Uninit(void)
{
	delete this;
}