//=============================================================================
//
// lightヘッダ[light.h]
// Author :増澤 未来
//
//=============================================================================
#ifndef _LIGHT_H_
#define _LIGHT_H_

//*****************************
//インクルード
//*****************************
#include "main.h"

//*****************************
// マクロ定義
//*****************************
#define LIGHT_DIR_BASE  D3DXVECTOR3(0.0f, -0.7f,-0.7f)// ライトの方向

//*****************************
// 前方宣言
//*****************************


//*****************************
// クラス定義
//*****************************
// ライトクラス
class CLight
{
public:
	//============
	//メンバ関数
	//============
	CLight();
	~CLight();

	HRESULT Init(void); // 初期化
	void Uninit(void);  // 終了
	void Update(void);  // 更新

	void SetDir(D3DXVECTOR3 vecDir); // 向きのセット
	D3DXVECTOR3 GetDir(void) { return m_Light.Direction; }
private:
	//============
	// メンバ変数
	//============
	D3DLIGHT9 m_Light;	// ライト
};


#endif