//=============================================================================
//
// model_shaderヘッダ [model_shader.h]
// Author : 増澤 未来
//
//=============================================================================

//二重インクルード防止
#ifndef _MODEL_SHADER_H_
#define _MODEL_SHADER_H_

//*****************************
// インクルード
//*****************************
#include "main.h"
#include "model.h"

//*****************************
// マクロ定義
//*****************************

//*****************************
// 前方宣言
//*****************************

//*****************************
// クラス定義
//*****************************

// キャラクタークラス
class CModelShader : public CModel
{
public:
	//==========================
	// 列挙
	//==========================


	//==========================
	// メンバ関数
	//==========================
	CModelShader(int nPliority = OBJTYPE_NONE);
	~CModelShader();

	HRESULT Init(void); // 初期化
	void Uninit(void);  // 終了
	void Update(void);  // 更新
	void Draw(void);    // 描画

	// セッター・ゲッター
	// シェーダー構造体
	void SetShader(Shader shader) { m_shader = shader; }
	Shader GetShader(void) { return m_shader; }

private:

	//==========================
	// メンバ変数
	//==========================
	Shader m_shader;    // シェーダー構造体
};
#endif