//=============================================================================
//
//  [titlemenu.h]
// Author : Masuzawa Mirai
//
//=============================================================================

// 二重インクルード防止
#ifndef _PAUSE_H_
#define _PAUSE_H_

//***************************************************************************************
// インクルードファイル
//***************************************************************************************
#include "scene.h"

//***************************************************************************************
// 前方宣言
//***************************************************************************************
class CPolygon;

//***************************************************************************************
// クラス定義
//***************************************************************************************

// ポーズクラス
class CPause
{
public:

	//============
	// 状態列挙
	//============
	// ポーズパーツ数
	typedef enum
	{
		BACK = 0,
		RESUME,
		RESTART,
		EXIT,
		PARTS_MAX
	}MENU_PARTS;

	//============
	// メンバ関数
	//============
	CPause();
	~CPause();

	// staic
	static CPause* Create(void); // クラス生成
	static HRESULT Load(void);   // テクスチャロード
	static void Unload(void);    // テクスチャアンロード

	HRESULT Init(void); // 初期化
	void Uninit(void);  // 終了
	void Update(void);  // 更新
	void Draw(void);    // 描画

private:
	//============
	// メンバ変数
	//============
	static LPDIRECT3DTEXTURE9 m_apTexture[PARTS_MAX]; // テクスチャ
	CPolygon* m_pPolygon[PARTS_MAX];                  // ポリゴン
	int m_nMenu;                                      // メニュー選択用
	bool m_bMove;                                     // 移動フラグ
};

#endif // !_TITEL_H_