//=============================================================================
//
// rank_uiヘッダ [rank_ui.h]
// Author : 増澤 未来
//
//=============================================================================

//二重インクルード防止
#ifndef _RANK_UI_H_
#define _RANK_UI_H_

//*****************************
//インクルード
//*****************************
#include "main.h"
#include "scene.h"

//=============================
// 前方宣言
//=============================
class CBillboard;

//*****************************
//マクロ定義
//*****************************

//*****************************
//クラス定義
//*****************************

//ランクUIクラス
class CRankUI : public CScene
{
public:
	//*****************************
	// 列挙定義
	//*****************************

	//*****************************
	// メンバ関数
	//*****************************
	CRankUI();
	~CRankUI();

	static CRankUI *Create(D3DXVECTOR3 pos , int nRank); // クラス生成

	HRESULT Init(void); // 初期化
	void Uninit(void);  // 終了
	void Update(void);  // 更新
	void Draw(void);    // 描画

private:

	//*****************************
	// メンバ変数
	//*****************************
	CBillboard * m_pBillboard;
	D3DXVECTOR3 m_pos;
	int m_nRank;

	int m_nCntAnim;       // アニメーションカウント
	int m_nAnimX;         // アニメーションX軸
};

#endif