//=============================================================================
//
// rule_baseヘッダ[rule_base.h]
// Author :増澤 未来
//
//=============================================================================
#ifndef _RULE_BASE_H_
#define _RULE_BASE_H_

//*****************************
//インクルード
//*****************************
#include "main.h"

//*****************************
// マクロ定義
//*****************************

//*****************************
// 前方宣言
//*****************************

//*****************************
// クラス定義
//*****************************
// ルール基礎クラス
class CRuleBase
{
public:
	//============
	//メンバ関数
	//============
	CRuleBase() {};
	virtual ~CRuleBase() {};

	virtual HRESULT Init(void) = 0; // 初期化
	virtual void Uninit(void) = 0;  // 終了
	virtual void Update(void) = 0;  // 更新

private:
	//============
	// メンバ変数
	//============

};


#endif