//=============================================================================
//
// warningヘッダ [warning.h]
// Author : 増澤 未来
//
//=============================================================================

//二重インクルード防止
#ifndef _WARNING_H_
#define _WARNING_H_

//*****************************
//インクルード
//*****************************
#include "main.h"
#include "scene.h"

//=============================
// 前方宣言
//=============================
class CBillboard;

//*****************************
//マクロ定義
//*****************************

//*****************************
//クラス定義
//*****************************

//警告クラス
class CWarningUI : public CScene
{
public:
	//*****************************
	// 列挙定義
	//*****************************

	//*****************************
	// メンバ関数
	//*****************************
	CWarningUI();
	~CWarningUI();

	static CWarningUI *Create(int nPlayerNum); // クラス生成

	HRESULT Init(void); // 初期化
	void Uninit(void);  // 終了
	void Update(void);  // 更新
	void Draw(void);    // 描画

private:
	D3DXVECTOR3 ReturnUIPosition(void);

	//*****************************
	// メンバ変数
	//*****************************
	CBillboard * m_pBillboard; // ビルボード
	int m_nPlayerNum;          // プレイヤー番号
	float m_fAlpha;            // アルファ値
	int m_nCloudCount;         // 雲生成カウント
};

#endif